export const zodiacSign = (day: number, month: number): string => {
  return (month === 1 && day >= 20) || (month === 2 && day <= 18)
    ? "水瓶座"
    : (month === 2 && day >= 19) || (month === 3 && day <= 20)
    ? "雙魚座"
    : (month === 3 && day >= 21) || (month === 4 && day <= 19)
    ? "牡羊座"
    : (month === 4 && day >= 20) || (month === 5 && day <= 20)
    ? "金牛座"
    : (month === 5 && day >= 21) || (month === 6 && day <= 20)
    ? "雙子座"
    : (month === 6 && day >= 21) || (month === 7 && day <= 22)
    ? "巨蟹座"
    : (month === 7 && day >= 23) || (month === 8 && day <= 22)
    ? "獅子座"
    : (month === 8 && day >= 23) || (month === 9 && day <= 22)
    ? "處女座"
    : (month === 9 && day >= 23) || (month === 10 && day <= 22)
    ? "天秤座"
    : (month === 10 && day >= 23) || (month === 11 && day <= 21)
    ? "天蠍座"
    : (month === 11 && day >= 22) || (month === 12 && day <= 21)
    ? "射手座"
    : "摩羯座";
};

export const zodiacAnalysis = (sign: string): string => {
  const analyses: { [key: string]: string } = {
    水瓶座: "水瓶座以創新和進步著稱。",
    雙魚座: "雙魚座是富有同情心和藝術氣質的人。",
    牡羊座: "牡羊座是勇敢和充滿活力的。",
    金牛座: "金牛座是可靠和有耐心的。",
    雙子座: "雙子座是適應性強和外向的。",
    巨蟹座: "巨蟹座是直覺和多愁善感的。",
    獅子座: "獅子座是自信和慷慨的。",
    處女座: "處女座是分析和細緻的。",
    天秤座: "天秤座是外交和迷人的。",
    天蠍座: "天蠍座是充滿激情和足智多謀的。",
    射手座: "射手座是愛冒險和樂觀的。",
    摩羯座: "摩羯座是紀律嚴明和負責任的。",
  };
  return analyses[sign] || "沒有分析資料。";
};

export const compatibilityAnalysis = (sign1: string, sign2: string): string => {
  const analyses: { [key: string]: string } = {
    水瓶座雙魚座:
      "水瓶座和雙魚座共享深厚的智慧聯繫，但可能在情感連接上有困難。",
    牡羊座金牛座: "牡羊座和金牛座有強烈的身體聯繫，但可能因為固執而衝突。",
    雙子座巨蟹座: "雙子座和巨蟹座有互補的關係，平衡彼此的優勢和弱點。",
    金牛座金牛座: "兩個金牛座在一起可以創造穩定和諧的關係。",
    雙子座雙子座:
      "兩個雙子座在一起可以有令人興奮和充滿活力的關係，充滿智力刺激。",
    巨蟹座巨蟹座: "兩個巨蟹座在一起可以形成深厚情感和滋養的關係。",
    獅子座獅子座:
      "兩個獅子座在一起可以創造充滿激情和戲劇性的關係，彼此互相仰慕。",
    處女座處女座: "兩個處女座在一起可以形成實際和高效的關係，專注於共同目標。",
    天秤座天秤座: "兩個天秤座在一起可以創造平衡和諧的關係，充滿相互尊重。",
    天蠍座天蠍座: "兩個天蠍座在一起可以形成充滿激情和深厚的關係。",
    射手座射手座:
      "兩個射手座在一起可以創造愛冒險和令人興奮的關係，充滿相互探索。",
    摩羯座摩羯座:
      "兩個摩羯座在一起可以形成紀律嚴明和目標導向的關係，專注於共同成功。",
  };
  return analyses[sign1 + sign2] || "沒有特定的配對分析資料。";
};

export const compatibilityScore = (sign1: string, sign2: string): number => {
  const compatibilityChart: { [key: string]: number } = {
    水瓶座雙魚座: 80,
    牡羊座金牛座: 70,
    雙子座巨蟹座: 60,
    金牛座金牛座: 75,
    雙子座雙子座: 85,
    巨蟹座巨蟹座: 90,
    獅子座獅子座: 95,
    處女座處女座: 80,
    天秤座天秤座: 85,
    天蠍座天蠍座: 70,
    射手座射手座: 65,
    摩羯座摩羯座: 75,
  };
  return compatibilityChart[sign1 + sign2] || 50;
};
